Revit 2026 API
WireSizeSetIterator Constructor
For Internal Use Only.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public WireSizeSetIterator()
Public Sub New
public:
WireSizeSetIterator()
new : unit -> WireSizeSetIterator
Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.
See Also
Reference
WireSizeSetIterator Class
Autodesk.Revit.DB.Electrical Namespace